** Clock
   This is the clock. We get the values of the PLL generator by running the following code:
 #+BEGIN_src shell
icepll -i 12 -o 25
 #+end_src

 #+RESULTS:
 | F_PLLIN:      |   12.0 | MHz          | (given)     |
 | F_PLLOUT:     |   25.0 | MHz          | (requested) |
 | F_PLLOUT:     | 25.125 | MHz          | (achieved)  |
 | FEEDBACK:     | SIMPLE |              |             |
 | F_PFD:        |   12.0 | MHz          |             |
 | F_VCO:        |  804.0 | MHz          |             |
 | DIVR:         |      0 | (4'b0000)    |             |
 | DIVF:         |     66 | (7'b1000010) |             |
 | DIVQ:         |      5 | (3'b101)     |             |
 | FILTER_RANGE: |      1 | (3'b001)     |             |

   #+BEGIN_SRC verilog :tangle rtl/clk_25MHz_generator.v
// Copyright (c) 2017-2018 Roland Coeurjoly
// This program is GPL Licensed. See LICENSE for the full license.

module clk_25MHz_generator(
			   input wire  i_clk_12MHz,
			   output wire o_clk_25MHz
			   );

`ifndef SYNTHESIS
   // SIMULATION
   assign o_clk_25MHz = i_clk_12MHz;
`else
   // SYNTHESIS
   SB_PLL40_CORE #(
		   .FEEDBACK_PATH("SIMPLE"),
		   .PLLOUT_SELECT("GENCLK"),
		   .DIVR(4'b0001),
		   .DIVF(7'b1000010),
		   .DIVQ(3'b100),
		   .FILTER_RANGE(3'b001),
		   ) uut (
			  .REFERENCECLK(i_clk_12MHz),
			  .PLLOUTCORE(o_clk_25MHz),
			  .RESETB(1'b1),
			  .BYPASS(1'b0)
			  );
`endif

endmodule

   #+END_SRC
*** Initial matrix
    For convenience, we read a file for the initial state of cells
    #+BEGIN_SRC verilog :tangle assets/initial_matrix.txt
00000000000000000000
00000000000000000000
00000000000000010000
00000000000000100000
00000011111110000000
00000000010000010000
00000000010000100000
00000011111110000000
00000000010000000000
00000000010000100000
00000011111110010000
00000000000000000000
00000000000000000000
00000000000000000000
00000000000000000000
    #+END_SRC

    #+BEGIN_SRC shell
echo "obase=2;243" | bc
    #+END_SRC

    #+RESULTS:
    : 11110011

